XML (Используется реже)
xml
<person>
  <name>Иван</name>
  <age>25</age>
  <is_student>false</is_student>
</person>
👨‍💻 Практика: работа с GitHub API
Мы будем использовать GitHub REST API, чтобы получить список репозиториев пользователя.

1. Что понадобится?
Установите библиотеку requests:

bash
pip install requests
2. Как выглядит запрос?
URL для получения репозиториев пользователя:

text
GET https://api.github.com/users/{username}/repos
Замените {username} на имя нужного пользователя (например, torvalds).

3. Пример кода
python
import requests

# Имя пользователя GitHub
username = "torvalds"  # Можно заменить на любое имя пользователя

# URL для запроса
url = f"https://api.github.com/users/{username}/repos"

# Делаем GET-запрос к API
response = requests.get(url)

# Проверяем статус ответа
if response.status_code == 200:
    # Преобразуем ответ в JSON
    repos = response.json()
    
    # Выводим информацию о каждом репозитории
    print(f"Репозитории пользователя {username}:")
    for repo in repos:
        print(f"- {repo['name']} (⭐ {repo['stargazers_count']} stars)")
else:
    print(f"Не удалось получить данные. Код ошибки: {response.status_code}")
4. Как это работает?
Скрипт отправляет HTTP-запрос типа GET на URL API GitHub.

GitHub возвращает данные в формате JSON — список репозиториев.

Скрипт проверяет статус ответа и выводит данные о репозиториях.

5. Пример вывода
text
Репозитории пользователя torvalds:
- linux (⭐ 157000 stars)
- subsurface (⭐ 390 stars)
- test-tlb (⭐ 280 stars)
📋 Задания
Задание 1: Мини-аналитика профиля GitHub
Цель: Научиться работать с REST API, разбираться в структуре JSON-ответов и использовать API GitHub для анализа данных.

Задача:
Написать программу на Python, которая:

Запрашивает у пользователя имя на GitHub.

Получает через API информацию о публичных репозиториях этого пользователя.

Строит аналитику:

Общее количество публичных репозиториев.

Суммарное количество звёзд (stargazers).

Самый популярный репозиторий (его имя и количество звёзд).

Топ языков программирования (какие языки и в скольких репозиториях используются).

Требования:

Использовать библиотеку requests.

Реализовать обработку ошибок (неверное имя, лимит запросов).

Разбить код на функции: get_repos(username), analyze_repos(repos), main().

Пример вывода:

text
Аналитика профиля GitHub: torvalds
----------------------------------
- Количество публичных репозиториев: 6
- Общее количество звёзд: 157670
- Самый популярный репозиторий: linux (⭐ 157000)
- Топ языков программирования:
  - C: 4 репозитория
  - Python: 1 репозиторий
  - Shell: 1 репозиторий
Задание 2: Работа с внешним API
Цель: Закрепить навыки работы с документацией API и обработки данных от сторонних сервисов.

Задача:

Выберите любой публичный API из списка (например, погода, новости, фильмы, аниме).

Изучите его документацию.

Напишите программу на Python, которая:

Выполняет корректный запрос к этому API.

Обрабатывает ответ (JSON/XML).

Выводит полученные данные в удобочитаемом виде (в консоль или файл).

Требования:

Самостоятельно разобраться в документации выбранного API.

Реализовать как минимум один осмысленный запрос (например, получить прогноз погоды для вашего города, найти фильм по названию, вывести список топ-новостей).

⚡ Установка и запуск
Клонируйте репозиторий:

bash
git clone https://github.com/ваш-username/api-tutorial.git
cd api-tutorial
Установите необходимые зависимости:

bash
pip install -r requirements.txt
Запустите любой из примеров:

bash
python github_api_example.py
📁 Структура проекта
text
api-tutorial/
│
├── github_api_example.py  # Базовый пример работы с GitHub API
├── profile_analyzer.py    # Решение задания 1 (аналитика профиля)
├── external_api_example.py # Решение задания 2 (работа с внешним API)
├── requirements.txt       # Зависимости проекта
└── README.md             # Этот файл
🤝 Как внести вклад
Если вы хотите улучшить этот учебный материал:

Сделайте форк (Fork) репозитория

Создайте ветку для вашей функции (git checkout -b feature/amazing-feature)

Зафиксируйте изменения (git commit -m 'Add some amazing feature')

Запушите в ветку (git push origin feature/amazing-feature)

Откройте Pull Request

📄 Лицензия
Этот проект распространяется под лицензией MIT. Подробнее см. в файле LICENSE.

🔗 Полезные ссылки
Документация GitHub REST API

Официальная документация по библиотеке requests

Список публичных API для экспериментов

HTTP коды состояния